"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Нужно отредактировать функцию str_bool, которая принимает логическое значение
так, чтобы она возвращала его текстовое представление

ПРИМЕРЫ
--------------------------------------------------------------------------------
- str_bool(True) -> 'True'
- str_bool(False) -> 'False'
"""


def str_bool(val: bool) -> str:
    """Возвращает строковое представление для логического значения

    :param val: True или False
    :type val: bool

    :return: Строковое представления
    :rtype: str
    """
    if val == True:
        result = 'True'
    else:
        result = 'False'
    return result


if __name__ == '__main__':
    val = input('Введите 1 для True, 0 для False: ')
    print(f'Результат: {str_bool(val)}')
